AcDbHostApplicationServices.getPassword(System.Char!System.Runtime.CompilerServices.IsConst*,AcDbHostApplicationServices.PasswordOptions,AcString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function is called internally by host applications such as AutoCAD and other ObjectARX applications
(via the readDwgFile() and acedSyncFileOpen() functions) to display a password-request dialog box.
dwgName: Name of the drawing file that is requiring a password
options: Boolean indicating whether dwgName refers to an xref'd drawing
password: Return password obtained from the user
Returns: Return true if succeed, false otherwise.

AcDbHostApplicationServices.getDefaultPlotCfgInfo(AcString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function allows host applications to specify a default device name and style for new AcDbPlotSettings objects
devName: Default device name (Plot Config Name)
styleName: Default style sheet name